# YOLOv12n SSDD - Maximum mAP Optimization
# Target: mAP50 0.985 → 0.990+ (NO GFLOPs change!)
# GFLOPs: 6.0G (architecture unchanged)
# Strategy: Precision-focused hyperparameter tuning

nc: 1

scales:
  n: [0.50, 0.25, 512]
  s: [0.65, 0.65, 512]
  m: [0.80, 0.90, 512]
  l: [1.15, 1.15, 512]
  x: [1.15, 1.40, 512]

# ---------------- BACKBONE (UNCHANGED - 6.0 GFLOPs) ----------------
backbone:
  - [-1, 1, Conv, [32, 3, 2]]        # 0  -> 256x256
  - [-1, 1, Conv, [64, 3, 2]]        # 1  -> 128x128
  - [-1, 2, C3Ghost, [96, 0.4]]      # 2  -> 128x128
  - [-1, 1, Conv, [128, 3, 2]]       # 3  -> 64x64
  - [-1, 3, C3Ghost, [256, 0.4]]     # 4  -> 64x64
  - [-1, 1, SPPF, [256, 5]]          # 5  -> 64x64
  - [-1, 1, Conv, [256, 3, 2]]       # 6  -> 32x32
  - [-1, 2, C3Ghost, [512, 0.4]]     # 7  -> 32x32
  - [-1, 1, Conv, [512, 3, 2]]       # 8  -> 16x16
  - [-1, 1, C3Ghost, [512, 0.4]]     # 9  -> 16x16

# ---------------- HEAD (UNCHANGED - 6.0 GFLOPs) ----------------
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10 -> 32x32
  - [[-1, 7], 1, Concat, [1]]                    # 11 -> 32x32
  - [-1, 2, C3Ghost, [256, 0.4]]                 # 12 -> 32x32
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13 -> 64x64
  - [[-1, 4], 1, Concat, [1]]                    # 14 -> 64x64
  - [-1, 1, C3Ghost, [128, 0.4]]                 # 15 -> 64x64
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16 -> 128x128
  - [[-1, 2], 1, Concat, [1]]                    # 17 -> 128x128
  - [-1, 1, C3Ghost, [96, 0.4]]                  # 18 -> 128x128
  - [-1, 1, Conv, [96, 3, 2]]                    # 19 -> 64x64
  - [[-1, 15], 1, Concat, [1]]                   # 20 -> 64x64
  - [-1, 1, C3Ghost, [128, 0.4]]                 # 21 -> 64x64
  - [-1, 1, Conv, [128, 3, 2]]                   # 22 -> 32x32
  - [[-1, 12], 1, Concat, [1]]                   # 23 -> 32x32
  - [-1, 1, C3Ghost, [256, 0.4]]                 # 24 -> 32x32
  - [-1, 1, Conv, [256, 3, 2]]                   # 25 -> 16x16
  - [[-1, 9], 1, Concat, [1]]                    # 26 -> 16x16
  - [-1, 1, C3Ghost, [512, 0.4]]                 # 27 -> 16x16
  - [[18, 21, 24, 27], 1, Detect, [nc]]          # 28 (P2, P3, P4, P5)

# =====================================================
# 🎯 MAXIMUM mAP OPTIMIZATION (NO GFLOPs CHANGE!)
# =====================================================

epochs: 300  # ⚡ Standard 300 epochs

# ========== PRECISION-FOCUSED AUGMENTATION ==========
# Reduced augmentation = better feature learning
mosaic: 0.8              # ⚡ Lower (was 1.0) - less distortion
mixup: 0.1               # ⚡ Lower (was 0.2) - preserve ship features
copy_paste: 0.3          # ⚡ Lower (was 0.6) - less synthetic data
degrees: 15.0            # ⚡ Lower (was 30.0) - less rotation
translate: 0.05          # ⚡ Lower (was 0.1) - keep ships centered
scale: 0.3               # ⚡ Lower (was 0.5) - less scale variation
shear: 2.0               # ⚡ Lower (was 5.0) - less distortion
perspective: 0.00001     # ⚡ Minimal perspective
flipud: 0.5              
fliplr: 0.5              
hsv_h: 0.010             # ⚡ Lower (was 0.015) - less color shift
hsv_s: 0.5               # ⚡ Lower (was 0.7)
hsv_v: 0.3               # ⚡ Lower (was 0.4)
erasing: 0.1             # ⚡ Lower (was 0.2) - less data loss
auto_augment: 'randaugment'
augment: True

# ========== CRITICAL: EARLY MOSAIC CLOSE ==========
close_mosaic: 40         # ⚡ Close at epoch 260 (300-40=260)
                         # Last 40 epochs = pure fine-tuning!
                         # Maximum fine-tuning time dalam 300 epochs

# ========== OPTIMIZED LOSS FOR MAXIMUM mAP ==========
box: 8.0                 # ⚡ Higher (was 7.5) - better localization
cls: 0.3                 # ⚡ Lower (was 0.5) - single class needs less
dfl: 1.8                 # ⚡ Higher (was 1.5) - better distribution
anchor_t: 4.5            # ⚡ Higher (was 4.0) - stricter matching
fl_gamma: 2.0            # ⚡ Higher (was 1.5) - focus on hard cases
iou_t: 0.25              # ⚡ Higher (was 0.20) - stricter IoU
label_smoothing: 0.0     

# Loss gains (precision-focused)
bbox_loss_gain: 1.2      # ⚡ Higher (was 1.0)
cls_loss_gain: 0.3       # ⚡ Lower (was 0.5)
obj_loss_gain: 1.0       

ciou: True               
diou: False              
focal: True              
smooth: False            

# ========== OPTIMAL LEARNING RATE SCHEDULE ==========
lr0: 0.008               # ⚡ Slightly lower (was 0.01) - more stable
lrf: 0.005               # ⚡ Lower (was 0.01) - better convergence
momentum: 0.940          # ⚡ Higher (was 0.937) - more smoothing
weight_decay: 0.0003     # ⚡ Lower (was 0.0005) - less regularization
warmup_epochs: 5.0       # ⚡ Longer (was 3.0) - smoother start
warmup_momentum: 0.8     
warmup_bias_lr: 0.1      

optimizer: 'AdamW'
scheduler: 'cosine'      
cos_lr: True
min_lr: 0.00005          # ⚡ Lower (was 0.0001) - finer adjustments

# ========== DROPOUT & EMA (STABILITY) ==========
dropout: 0.0             
ema_decay: 0.9999        # ⚡ Higher (was 0.9998) - more stable
ema_updates: 2000        
ema_decay_fn: 'exp'

# ========== TASK ALIGNED ASSIGNMENT ==========
loss_ota: True
simota_epochs: 150       # ⚡ Extended (was 100)
tal_topk: 12             # ⚡ Higher (was 10) - more candidates
tal_alpha: 0.6           # ⚡ Higher (was 0.5) - stronger class weight
tal_beta: 6.5            # ⚡ Higher (was 6.0) - stricter IoU weight

# ========== MULTI-SCALE (CONTROLLED) ==========
progressive_resize: False
multiscale: True
multiscale_low: 0.95     # ⚡ Narrower (was 0.9) - more stable
multiscale_high: 1.05    # ⚡ Narrower (was 1.1)

# ========== INFERENCE SETTINGS (PRECISION) ==========
conf: 0.0005             # ⚡ Lower (was 0.001) - catch more detections
iou: 0.50                # ⚡ Higher (was 0.45) - stricter NMS
max_det: 1500            
agnostic_nms: False
amp: True                

# ========== TRAINING PARAMETERS ==========
batch: 16                
workers: 8
imgsz: 720               
device: 0
single_cls: True

# ========== VALIDATION & MONITORING ==========
val: True
val_period: 1            
save_period: 5           
save_best: True
save_last: True
patience: 80             # ⚡ Cukup untuk 300 epochs
metric: 'mAP50-95'       

plots: True
verbose: True
save_json: True
save_hybrid: True
save_conf: True
save_crop: False

# ========== OPTIMIZATION FLAGS ==========
sync_bn: True
freeze: []
pretrained: True
deterministic: True      # ⚡ Deterministic for reproducibility
cudnn_benchmark: True
pin_memory: True
persistent_workers: True
half: False
dnn: False
gradient_clip: 8.0       # ⚡ Lower (was 10.0) - prevent gradient explosion

# ========== PROJECT SETUP ==========
project: 'ssdd_map_boost'
name: 'yolov12n_v2'
exist_ok: True
resume: False            
profile: False

# ========== ADDITIONAL SETTINGS ==========
rect: False
overlap_mask: True
mask_ratio: 4
seed: 42                 # ⚡ Fixed seed for reproducibility
fraction: 1.0

# =====================================================
# 🎯 MAP BOOST STRATEGY (6.0 GFLOPs MAINTAINED!)
# =====================================================
# 
# Current: mAP50 = 0.985, mAP50-95 = 0.711
# Target:  mAP50 = 0.990+, mAP50-95 = 0.730+
#
# ✅ Strategy 1: REDUCED AUGMENTATION
#    - Less distortion = clearer features
#    - Ships remain more recognizable
#    - Better feature learning
#
# ✅ Strategy 2: EXTENDED FINE-TUNING
#    - 40 epochs without mosaic (epoch 260-300)
#    - Maximum fine-tuning dalam 300 epochs
#    - Better convergence
#
# ✅ Strategy 3: PRECISION-FOCUSED LOSS
#    - Higher box loss (8.0) = better localization
#    - Lower cls loss (0.3) = focus on detection
#    - Higher dfl (1.8) = better bbox distribution
#
# ✅ Strategy 4: STRICTER MATCHING
#    - Higher anchor_t (4.5)
#    - Higher iou_t (0.25)
#    - Higher tal_topk (12)
#    - Better quality assignments
#
# ✅ Strategy 5: STABLE TRAINING
#    - Higher momentum (0.940)
#    - Higher EMA decay (0.9999)
#    - Lower weight decay (0.0003)
#    - Smoother gradient updates
#
# ✅ Strategy 6: FINER LEARNING
#    - Lower lr0 (0.008)
#    - Lower lrf (0.005)
#    - Lower min_lr (0.00005)
#    - Better fine-tuning precision
#
# ✅ Strategy 7: OPTIMAL 300 EPOCHS
#    - 300 epochs total
#    - Patience 80
#    - Close mosaic at 260
#    - Maximum efficiency
#
# 🎯 Expected Results:
# - mAP50: 0.985 → 0.990-0.993
# - mAP50-95: 0.711 → 0.730-0.750
# - Precision: 0.947 → 0.960+
# - Recall: 0.962 → 0.970+
# - GFLOPs: Exactly 6.0G (NO CHANGE!)
# - Training time: ~2.3-2.5 hours
#
# =====================================================

# =====================================================
# 📊 KEY DIFFERENCES FROM ORIGINAL CONFIG:
# =====================================================
# 
# Augmentation (Reduced for precision):
#   mosaic: 1.0 → 0.8
#   mixup: 0.2 → 0.1
#   copy_paste: 0.6 → 0.3
#   degrees: 30 → 15
#   translate: 0.1 → 0.05
#   scale: 0.5 → 0.3
#
# Loss Weights (Precision-focused):
#   box: 7.5 → 8.0
#   cls: 0.5 → 0.3
#   dfl: 1.5 → 1.8
#   bbox_loss_gain: 1.0 → 1.2
#
# Learning Rate (Finer tuning):
#   lr0: 0.01 → 0.008
#   lrf: 0.01 → 0.005
#   min_lr: 0.0001 → 0.00005
#
# Training Duration (Optimized for 300):
#   epochs: 300 (tetap)
#   close_mosaic: 30 → 40
#   patience: 50 → 80
#
# Assignment (Stricter):
#   tal_topk: 10 → 12
#   tal_alpha: 0.5 → 0.6
#   iou_t: 0.20 → 0.25
#
# =====================================================

# =====================================================
# 🚀 TRAINING COMMAND:
# =====================================================
# from ultralytics import YOLO
#
# model = YOLO("yolov12n.yaml")
# 
# results = model.train(
#     data="ssdd.yaml",
#     epochs=300,
#     batch=16,
#     imgsz=720,
#     project="ssdd_map_boost",
#     name="yolov12n_v2",
#     patience=80,
#     close_mosaic=40,
#     verbose=True,
#     seed=42
# )
#
# # Validate best model
# metrics = model.val()
# print(f"mAP50: {metrics.box.map50:.3f}")
# print(f"mAP50-95: {metrics.box.map:.3f}")
# =====================================================