nc: 1

scales:
  n: [0.50, 0.25, 512]
  s: [0.65, 0.65, 512]
  m: [0.80, 0.90, 512]
  l: [1.15, 1.15, 512]
  x: [1.15, 1.40, 512]

# ---------------- BACKBONE ----------------
backbone:
  - [-1, 1, Conv, [32, 3, 2]]
  - [-1, 1, Conv, [64, 3, 2]]

  - [-1, 2, RepC3, [96]]

  - [-1, 1, Conv, [128, 3, 2]]

  - [-1, 3, RepC3, [256]]

  - [-1, 1, SPPF, [256, 5]]

  - [-1, 1, Conv, [256, 3, 2]]

  - [-1, 2, RepC3, [512]]

  - [-1, 1, Conv, [512, 3, 2]]

  - [-1, 1, RepC3, [512]]

# ---------------- HEAD ----------------
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]

  - [-1, 2, RepC3, [256]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]

  - [-1, 2, RepC3, [128]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]

  - [-1, 2, RepC3, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]

  - [-1, 1, RepC3, [512]]

  - [[15, 18, 21], 1, Detect, [nc]]
